"use client";

import * as React from "react";
import { Component } from "react";

const linksArr: string[] = ["О компании", "Новости", "Статьи", "Контакты"];

const PhoneSvg = () => (
  <svg
    width="20"
    height="21"
    viewBox="0 0 20 21"
    fill="none"
    xmlns="http://www.w3.org/2000/svg"
  >
    <path
      fill-rule="evenodd"
      clip-rule="evenodd"
      d="M13.7933 18.9442C12.5933 18.9001 9.19242 18.4301 5.63075 14.8692C2.06992 11.3076 1.60075 7.90756 1.55575 6.70672C1.48909 4.87672 2.89075 3.09922 4.50992 2.40506C4.7049 2.32086 4.91842 2.28881 5.12953 2.31204C5.34064 2.33527 5.54208 2.41298 5.71409 2.53756C7.04742 3.50922 7.96742 4.97922 8.75742 6.13506C8.93124 6.389 9.00556 6.69801 8.96622 7.00322C8.92687 7.30843 8.77662 7.5885 8.54409 7.79006L6.91825 8.99756C6.8397 9.05428 6.78441 9.13758 6.76265 9.23199C6.74089 9.3264 6.75413 9.42551 6.79992 9.51089C7.16825 10.1801 7.82325 11.1767 8.57325 11.9267C9.32409 12.6767 10.3674 13.3751 11.0833 13.7851C11.173 13.8354 11.2786 13.8495 11.3785 13.8244C11.4783 13.7993 11.5647 13.7369 11.6199 13.6501L12.6783 12.0392C12.8728 11.7808 13.1599 11.6076 13.4792 11.556C13.7986 11.5045 14.1256 11.5785 14.3916 11.7626C15.5641 12.5742 16.9324 13.4784 17.9341 14.7609C18.0688 14.9341 18.1545 15.1404 18.1822 15.3581C18.2099 15.5758 18.1786 15.7969 18.0916 15.9984C17.3941 17.6259 15.6291 19.0117 13.7933 18.9442Z"
      fill="#84C0EA"
    />
  </svg>
);

const MailSvg = () => (
  <svg
    width="20"
    height="21"
    viewBox="0 0 20 21"
    fill="none"
    xmlns="http://www.w3.org/2000/svg"
  >
    <path
      d="M16.5625 3.625H3.4375C2.85753 3.62562 2.30149 3.85629 1.89139 4.26639C1.48129 4.67649 1.25062 5.23253 1.25 5.8125V15.1875C1.25062 15.7675 1.48129 16.3235 1.89139 16.7336C2.30149 17.1437 2.85753 17.3744 3.4375 17.375H16.5625C17.1425 17.3744 17.6985 17.1437 18.1086 16.7336C18.5187 16.3235 18.7494 15.7675 18.75 15.1875V5.8125C18.7494 5.23253 18.5187 4.67649 18.1086 4.26639C17.6985 3.85629 17.1425 3.62562 16.5625 3.625ZM16.0086 7.24336L10.3836 11.6184C10.2739 11.7036 10.1389 11.7499 10 11.7499C9.86107 11.7499 9.72609 11.7036 9.61641 11.6184L3.99141 7.24336C3.92532 7.19345 3.86981 7.13091 3.8281 7.05936C3.78639 6.98781 3.75932 6.90869 3.74846 6.82659C3.73759 6.74449 3.74315 6.66104 3.76482 6.58111C3.78648 6.50118 3.82381 6.42635 3.87465 6.36097C3.92548 6.29559 3.9888 6.24096 4.06093 6.20027C4.13306 6.15957 4.21255 6.13362 4.2948 6.12391C4.37704 6.1142 4.4604 6.12094 4.54002 6.14372C4.61964 6.16651 4.69394 6.20489 4.75859 6.25664L10 10.3332L15.2414 6.25664C15.3725 6.15766 15.5372 6.11425 15.7 6.1358C15.8629 6.15734 16.0107 6.24211 16.1115 6.37177C16.2123 6.50142 16.258 6.66555 16.2387 6.82866C16.2195 6.99176 16.1368 7.14073 16.0086 7.24336Z"
      fill="#84C0EA"
    />
  </svg>
);

const headerClassLeft = () => `w-[162px] flex justify-between`;

interface HeaderProps {}

interface HeaderState {
  links: string[];
  contacts: { phone: string; mail: string };
}

const leftHeaderlinks = (linksArr: string[]): string[] => {
  const copyArr: string[] = [...linksArr];
  copyArr.forEach((e) => <p>${e}</p>);
  return copyArr;
};

export class Header extends React.Component<HeaderProps, HeaderState> {
  state: Readonly<HeaderState> = {
    links: linksArr,
    contacts: {
      phone: "+7(495)933-6147",
      mail: "max@maximum.su",
    },
  };

  render() {
    return (
      <header>
        <div className="flex justify-between mt-[24px]">
          <div className={`grid grid-cols-4 gap-[24px]`}>
            {this.state.links.map((e) => (
              <span>{e}</span>
            ))}
          </div>
          <div className="w-[367] flex justify-between">
            <div className={headerClassLeft()}>
              <PhoneSvg />
              <span>{this.state.contacts.phone}</span>
            </div>
            <div className={headerClassLeft()}>
              <MailSvg />
              <span>{this.state.contacts.mail}</span>
            </div>
          </div>
        </div>
      </header>
    );
  }
}

export default Header;
